Repository: level12/keg-elements
Catalog: keg_elements/i18n/*/LC_MESSAGES/keg_elements.po
Languages: es

source: If input file name doesn't end in ".enc" then output filename must be given.
es: Si el nombre del archivo de entrada no termina en ".enc", se debe dar el nombre del archivo de salida.

source: Base36 input too large
es: Entrada Base36 demasiado grande

source: Negative base36 conversion input.
es: Entrada de conversión base36 negativa.

source: Too many records to export as {}
es: Demasiados registros para exportar como {}

source: Key must be at least 32 bytes long
es: La clave debe tener al menos 32 bytes de longitud

source: Unknown column or relationship names in kwargs: {kwargs!r}
es: Nombres desconocidos de columna o relación en kwargs: {kwargs!r}

source: Updating property types is not implemented.
es: La actualización de los tipos de propiedad no está implementada.

source: No primary key was found in `oid` or `kwargs` for which to retrieve the object to edit
es: No se encontró ninguna clave primaria en `oid` o` kwargs` para la cual recuperar el objeto para editar

source: No randomization for this column type
es: Sin aleatorización para este tipo de columna

source: length must be at least 7
es: la longitud debe ser de al menos 7

source: Yes
es: Sí

source: Invalid Choice: could not coerce
es: Elección no válida: no se pudo coaccionar

source: '%(value)s' is not a valid choice for this field
es: '%(value)s' no es una opción válida para este campo

source: Must only contain alphanumeric data.
es: Solo debe contener datos alfanuméricos.

source: Value is not numeric.
es: El valor no es numérico.

source: Field must have no more than {scale} decimal places.
es: El campo no debe tener más de {scale} decimales.

source: Form must provide either `obj` or `_obj` property for uniqueness validation.
es: El formulario debe proporcionar la propiedad `obj` o` _obj` para la validación de unicidad.

source: This value must be unique but is already assigned.
es: Este valor debe ser único pero ya está asignado.

source: This value must be unique but is already assigned to {link}.
es: Este valor debe ser exclusivo, pero ya tiene asignado a {link}.
